app/views/welcome/dashboard.html.erb

SELECT "projects".* FROM "projects" INNER JOIN "user_projects" ON "projects"."id" = "user_projects"."project_id" WHERE "user_projects"."user_id" = ?  [["user_id", 1]]
---
  <ul>
    <% @user.projects.each do |project| %>