app/views/projects/show.html.erb

  <strong>Contributors: </strong>
  <% @project.users.each do |user| %>
---
SELECT "users".* FROM "users" INNER JOIN "user_projects" ON "users"."id" = "user_projects"."user_id" WHERE "user_projects"."project_id" = ?  [["project_id", 1]]

  <table>
    <% @project.requests.each do |request| %>
---
SELECT "requests".* FROM "requests" WHERE "requests"."project_id" = ?  [["project_id", 1]]