app/controllers/projects_controller.rb

INSERT INTO "projects" ("title", "created_at", "updated_at", "auditee") VALUES (?, ?, ?, ?)  [["title", "Rock Park 2015"], ["created_at", "2017-07-01 15:53:24.298969"], ["updated_at", "2017-07-01 15:53:24.298969"], ["auditee", "Rock Park Corp"]]
---
  def create
    @project = Project.new(project_params)
    @project.users << current_user

UPDATE "projects" SET "auditee" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["auditee", "Rock Park Co"], ["updated_at", "2017-07-01 15:54:42.238329"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @project.update(project_params)