app/controllers/requests_controller.rb

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def new
    #need both request and project since form is nested resource
    @request = Request.new
    @project = Project.find(params[:project_id])

INSERT INTO "requests" ("title", "description", "project_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "TB"], ["description", "final TB for 2015"], ["project_id", 1], ["user_id", 2], ["created_at", "2017-07-01 17:25:52.477329"], ["updated_at", "2017-07-01 17:25:52.477329"]]
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def create
    @request = Request.new(request_params)
    authorize @request

    if @request.save
      redirect_to project_path(@request.project)
    else
      @project = Project.find(params[:project_id])

SELECT  "requests".* FROM "requests" WHERE "requests"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @request = Request.find(params[:id])