app/controllers/welcome_controller.rb

  def index
    if user_signed_in?
      add_example_project(current_user) if current_user.projects.empty?
---
SELECT "projects".* FROM "projects" INNER JOIN "user_projects" ON "projects"."id" = "user_projects"."project_id" WHERE "user_projects"."user_id" = ?  [["user_id", 1]]